; domain
(define (domain liftedtcore_minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :existential-preconditions :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 box ball - object_
 )
 (:constants
   empty - empty_0
   grey_box_1 purple_box_1 blue_box_1 - box
   room_1 room_4 - room
   red_door_1 blue_door_1 green_door_1 - door
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands) (hold_0) (seen_psi_1) (hold_2) (hold_3) (hold_4))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (when (or (objectinroom blue_box_1 room_4) (= ?room2 room_1) (and (agentinroom room_1) (not (= ?room1 room_1)))) (seen_psi_1)) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands) (seen_psi_1))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (hold_0) (when (or (and (objectinroom blue_box_1 room_4) (not (and (= ?obj blue_box_1) (= ?room room_4)))) (agentinroom room_1)) (seen_psi_1)) (when (or (= ?obj purple_box_1) (carrying purple_box_1)) (hold_3)) (when (or (not (locked red_door_1)) (= ?obj grey_box_1) (carrying grey_box_1)) (hold_4)) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (when (or (and (= ?obj blue_box_1) (= ?room room_4)) (objectinroom blue_box_1 room_4) (agentinroom room_1)) (seen_psi_1)) (when (and (carrying purple_box_1) (not (= ?obj purple_box_1))) (hold_3)) (when (or (not (locked red_door_1)) (and (carrying grey_box_1) (not (= ?obj grey_box_1)))) (hold_4)) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door) (or (and (not (locked ?door)) (= ?door blue_door_1)) (and (locked blue_door_1) (not (and (locked ?door) (= ?door blue_door_1))))))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (when (not (or (and (not (locked ?door)) (= ?door green_door_1)) (and (locked green_door_1) (not (and (locked ?door) (= ?door green_door_1)))))) (hold_2)) (when (or (not (or (and (not (locked ?door)) (= ?door red_door_1)) (and (locked red_door_1) (not (and (locked ?door) (= ?door red_door_1)))))) (carrying grey_box_1)) (hold_4)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_minigrid-problem)
 (:domain liftedtcore_minigrid-domain)
 (:objects
   room_2 room_3 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   purple_door_1 - door
   yellow_box_1 blue_box_2 green_box_2 green_box_1 - box
   grey_ball_1 - ball
 )
 (:init (agentinroom room_4) (objectinroom green_box_1 room_1) (objectinroom yellow_box_1 room_1) (objectinroom blue_box_1 room_2) (objectinroom grey_ball_1 room_2) (objectinroom green_box_2 room_3) (objectinroom purple_box_1 room_3) (objectinroom grey_box_1 room_4) (objectinroom blue_box_2 room_4) (objectcolor green_box_1 greentype) (objectcolor yellow_box_1 yellowtype) (objectcolor blue_box_1 bluetype) (objectcolor grey_ball_1 greytype) (objectcolor green_box_2 greentype) (objectcolor purple_box_1 purpletype) (objectcolor grey_box_1 greytype) (objectcolor blue_box_2 bluetype) (objectcolor purple_door_1 purpletype) (objectcolor red_door_1 redtype) (objectcolor blue_door_1 bluetype) (objectcolor green_door_1 greentype) (emptyhands) (locked purple_door_1) (locked red_door_1) (locked blue_door_1) (locked green_door_1) (adjacentrooms room_2 room_1 purple_door_1) (adjacentrooms room_1 room_2 purple_door_1) (adjacentrooms room_3 room_1 red_door_1) (adjacentrooms room_1 room_3 red_door_1) (adjacentrooms room_4 room_2 blue_door_1) (adjacentrooms room_2 room_4 blue_door_1) (adjacentrooms room_4 room_3 green_door_1) (adjacentrooms room_3 room_4 green_door_1) (visited room_4) (= (total-cost) 0))
 (:goal (and (exists (?v - ball)
 (and (objectcolor ?v greytype) (carrying ?v) (agentinroom room_2))) (hold_0) (hold_2) (hold_3) (hold_4)))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor green_door_1 room_4 room_3)
   added: (at_ green_door_1)
   goals met: 0 of 5
2. (toggle green_door_1)
   deleted: (locked green_door_1)
   added: (hold_2)
   goals met: 1 of 5
3. (gotoroom room_4 room_3 green_door_1)
   deleted: (agentinroom room_4) (at_ green_door_1)
   added: (agentinroom room_3) (visited room_3)
   goals met: 1 of 5
4. (gotodoor red_door_1 room_3 room_1)
   added: (at_ red_door_1)
   goals met: 1 of 5
5. (toggle red_door_1)
   deleted: (locked red_door_1)
   added: (hold_4)
   goals met: 2 of 5
6. (gotoroom room_3 room_1 red_door_1)
   deleted: (agentinroom room_3) (at_ red_door_1)
   added: (agentinroom room_1) (visited room_1) (seen_psi_1)
   goals met: 2 of 5
7. (gotodoor purple_door_1 room_1 room_2)
   added: (at_ purple_door_1)
   goals met: 2 of 5
8. (toggle purple_door_1)
   deleted: (locked purple_door_1)
   goals met: 2 of 5
9. (gotoroom room_1 room_3 red_door_1)
   deleted: (agentinroom room_1) (at_ purple_door_1)
   added: (agentinroom room_3)
   goals met: 2 of 5
10. (gotoobject purple_box_1 room_3)
   added: (at_ purple_box_1)
   goals met: 2 of 5
11. (pick purple_box_1 room_3)
   deleted: (at_ purple_box_1) (emptyhands) (objectinroom purple_box_1 room_3)
   added: (carrying purple_box_1) (hold_0) (hold_3)
   goals met: 4 of 5
12. (gotoroom room_3 room_1 red_door_1)
   deleted: (agentinroom room_3)
   added: (agentinroom room_1)
   goals met: 4 of 5
13. (gotoroom room_1 room_2 purple_door_1)
   deleted: (agentinroom room_1)
   added: (agentinroom room_2) (visited room_2)
   goals met: 4 of 5
14. (gotoempty)
   added: (at_ empty)
   goals met: 4 of 5
15. (drop purple_box_1 room_2)
   deleted: (carrying purple_box_1) (at_ empty)
   added: (at_ purple_box_1) (emptyhands) (objectinroom purple_box_1 room_2)
   goals met: 4 of 5
16. (gotoobject grey_ball_1 room_2)
   deleted: (at_ purple_box_1)
   added: (at_ grey_ball_1)
   goals met: 4 of 5
17. (pick grey_ball_1 room_2)
   deleted: (at_ grey_ball_1) (emptyhands) (objectinroom grey_ball_1 room_2)
   added: (carrying grey_ball_1)
   goals met: 5 of 5
